type(32) #자료형 확인

#문자열 
"안녕하세요"
"'안녕하세요'라고 말했습니다"
"\"안녕하세요\"라고 말했습니다" #이스케이프 문자 
\n  # 개행
\\ # 역슬래쉬 한 번 출력 

#템플릿 리터럴 
"""안녕하세요
안녕하세요
안녕하세요"""

"""\
    안녕하세요
    안녕하세요
    안녕하세요\
"""

#문자열 연산자 
연결 연산자 : + 
숫자랑 + 하면 에러 

반복 연산자 : * 

문자열 추출: print("안녕하세요[0]")
문자열 추출: print("안녕하세요[1]")
문자열 추출: print("안녕하세요[2]")
문자열 추출: print("안녕하세요[3]")
문자열 추출: print("안녕하세요[-1]")
문자열 추출: print("안녕하세요[-2]")

# 문자열 범위 선택 
print("안녕하세요[0:1]") => 0번째 선택 
print("안녕하세요[0:2]") => 0,1번째 선택 
** 뒤쪽의 숫자를  포함하지 않는다 (n-1까지)


#문자열 길이 구하기 
print(len('안녕하세요'))


